Revit 2027 API
CategoryNameMapIterator Properties
The CategoryNameMapIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the category that is the current focus of the iterator.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Key | Retrieves the category name that is the current focus of the iterator.
Top
See Also
Reference
CategoryNameMapIterator Class
Autodesk.Revit.DB Namespace